# 접근자(Accessor) 실습 ------------------------

-DF/SR에 속성으로 제공되며 다른 객체의 기능/속성을 사용할 수 있도록 해줌

- 종류
    - Series.dt   : datetime 관련 속성 사용 할 수 있도록 해줌
    - Series.str  : string 관련 메서드 사용 할 수 있도록 해줌
    - DataFrame.spare : spare 관련 속성/메서드 사용 할 수 있도록 해줌

In [12]:
# 모듈 로딩 -------------------------------------------------------
import pandas as pd, random

# 데이터 생성 -----------------------------------------------------
# 이름, 생년월일, 나이 3개 컬럼으로 구성
# 10명 
# 생년월일 : 동년해, 동일날짜   <- date_range() - 'birth' : pd.date_range('2022-01-10', preiods=10, freq='M')
# 이름 : 영문 (예: Tom Kim)       -   'age' : [random.randint(17,25) for count in range(10)]

In [15]:
df=pd.DataFrame({'name': ['HoJin Lee', 'GilDong Hong', 'Tom', 'Lee', 'Annan Jung', 'SangUn Shin', 'BungJun Park', 'MinSu Shin', 'Choi', 'Kang'],
                 'birth' : pd.date_range('2022-01-10', periods=10, freq='M'),
                 'age' : [random.randint(17,25) for count in range(10)]})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   birth   10 non-null     datetime64[ns]
 2   age     10 non-null     int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 368.0+ bytes

In [16]:
df

           name      birth  age
0     HoJin Lee 2022-01-31   18
1  GilDong Hong 2022-02-28   17
2           Tom 2022-03-31   20
3           Lee 2022-04-30   19
4    Annan Jung 2022-05-31   22
5   SangUn Shin 2022-06-30   22
6  BungJun Park 2022-07-31   25
7    MinSu Shin 2022-08-31   21
8          Choi 2022-09-30   24
9          Kang 2022-10-31   22

In [18]:
df.dtypes

name             object
birth    datetime64[ns]
age               int64
dtype: object

In [19]:
df['name'][0], type(df['name'][0])

('HoJin Lee', str)

In [20]:
df['name'][0].split()

['HoJin', 'Lee']

In [22]:
df['age'].max(), df['age'].mean()

(25, 21.0)

## str 데이터로 구성된 컬럼(Series)의 str 접근자 --

- 전체 컬럼의 요소에 str관련 메서드 사용 가능하도록 하는 접근자
- 사용법
        - 객체변수[컬럼명].str.메서드() => upper, lower, splitn replace,....
        - 객체변수[컬럼명].str.get(인덱스) => 분리 문자리스트에서 특정 요소 추출

In [23]:
# 문자열 분리 ------------------------
df['name'].str.split()

0       [HoJin, Lee]
1    [GilDong, Hong]
2              [Tom]
3              [Lee]
4      [Annan, Jung]
5     [SangUn, Shin]
6    [BungJun, Park]
7      [MinSu, Shin]
8             [Choi]
9             [Kang]
Name: name, dtype: object

In [25]:
df['name'].str.upper(), df['name'].str.contains('a')

(0       HOJIN LEE
 1    GILDONG HONG
 2             TOM
 3             LEE
 4      ANNAN JUNG
 5     SANGUN SHIN
 6    BUNGJUN PARK
 7      MINSU SHIN
 8            CHOI
 9            KANG
 Name: name, dtype: object,
 0    False
 1    False
 2    False
 3    False
 4     True
 5     True
 6     True
 7    False
 8    False
 9     True
 Name: name, dtype: bool)

In [26]:
df['name'].str.upper(), df['name'].str.contains('E')

(0       HOJIN LEE
 1    GILDONG HONG
 2             TOM
 3             LEE
 4      ANNAN JUNG
 5     SANGUN SHIN
 6    BUNGJUN PARK
 7      MINSU SHIN
 8            CHOI
 9            KANG
 Name: name, dtype: object,
 0    False
 1    False
 2    False
 3    False
 4    False
 5    False
 6    False
 7    False
 8    False
 9    False
 Name: name, dtype: bool)

In [29]:
df['name'].str.upper(), df['name'].str.capitalize()

(0       HOJIN LEE
 1    GILDONG HONG
 2             TOM
 3             LEE
 4      ANNAN JUNG
 5     SANGUN SHIN
 6    BUNGJUN PARK
 7      MINSU SHIN
 8            CHOI
 9            KANG
 Name: name, dtype: object,
 0       Hojin lee
 1    Gildong hong
 2             Tom
 3             Lee
 4      Annan jung
 5     Sangun shin
 6    Bungjun park
 7      Minsu shin
 8            Choi
 9            Kang
 Name: name, dtype: object)

In [30]:
df['name'].str.upper(), df['name'].str.lower()

(0       HOJIN LEE
 1    GILDONG HONG
 2             TOM
 3             LEE
 4      ANNAN JUNG
 5     SANGUN SHIN
 6    BUNGJUN PARK
 7      MINSU SHIN
 8            CHOI
 9            KANG
 Name: name, dtype: object,
 0       hojin lee
 1    gildong hong
 2             tom
 3             lee
 4      annan jung
 5     sangun shin
 6    bungjun park
 7      minsu shin
 8            choi
 9            kang
 Name: name, dtype: object)

In [34]:
# 성, 이름 따로 추가 (컬럼)
df2=df['name'][0].split()

['HoJin', 'Lee']

In [41]:
df['name'].str.split()

0       [HoJin, Lee]
1    [GilDong, Hong]
2              [Tom]
3              [Lee]
4      [Annan, Jung]
5     [SangUn, Shin]
6    [BungJun, Park]
7      [MinSu, Shin]
8             [Choi]
9             [Kang]
Name: name, dtype: object

In [44]:
flname=df['name'].str.split()
type(flname)

pandas.core.series.Series

In [45]:
flname[0][0], flname[0][1]

('HoJin', 'Lee')

In [49]:
# 분리된 문자열 리스트에서 특정 값 가져오기 ------------------------
flname.str.get(0), flname.str.get(1)

(0      HoJin
 1    GilDong
 2        Tom
 3        Lee
 4      Annan
 5     SangUn
 6    BungJun
 7      MinSu
 8       Choi
 9       Kang
 Name: name, dtype: object,
 0     Lee
 1    Hong
 2     NaN
 3     NaN
 4    Jung
 5    Shin
 6    Park
 7    Shin
 8     NaN
 9     NaN
 Name: name, dtype: object)

In [50]:
df['first_name']=flname.str.get(0)
df['last_name']=flname.str.get(1)

In [51]:
df

           name      birth  age first_name last_name
0     HoJin Lee 2022-01-31   18      HoJin       Lee
1  GilDong Hong 2022-02-28   17    GilDong      Hong
2           Tom 2022-03-31   20        Tom       NaN
3           Lee 2022-04-30   19        Lee       NaN
4    Annan Jung 2022-05-31   22      Annan      Jung
5   SangUn Shin 2022-06-30   22     SangUn      Shin
6  BungJun Park 2022-07-31   25    BungJun      Park
7    MinSu Shin 2022-08-31   21      MinSu      Shin
8          Choi 2022-09-30   24       Choi       NaN
9          Kang 2022-10-31   22       Kang       NaN

In [55]:
# str.split()
value= df['name'].str.split(expand=True)
type(value)

pandas.core.frame.DataFrame

In [56]:
value

         0     1
0    HoJin   Lee
1  GilDong  Hong
2      Tom  None
3      Lee  None
4    Annan  Jung
5   SangUn  Shin
6  BungJun  Park
7    MinSu  Shin
8     Choi  None
9     Kang  None

In [57]:
value.shape, value.ndim, value.columns, value.index

((10, 2),
 2,
 RangeIndex(start=0, stop=2, step=1),
 RangeIndex(start=0, stop=10, step=1))

In [59]:
df.dtypes

name                  object
birth         datetime64[ns]
age                    int64
first_name            object
last_name             object
dtype: object

In [60]:
df1=pd.concat([df, value], axis=1)
df1

           name      birth  age first_name last_name        0     1
0     HoJin Lee 2022-01-31   18      HoJin       Lee    HoJin   Lee
1  GilDong Hong 2022-02-28   17    GilDong      Hong  GilDong  Hong
2           Tom 2022-03-31   20        Tom       NaN      Tom  None
3           Lee 2022-04-30   19        Lee       NaN      Lee  None
4    Annan Jung 2022-05-31   22      Annan      Jung    Annan  Jung
5   SangUn Shin 2022-06-30   22     SangUn      Shin   SangUn  Shin
6  BungJun Park 2022-07-31   25    BungJun      Park  BungJun  Park
7    MinSu Shin 2022-08-31   21      MinSu      Shin    MinSu  Shin
8          Choi 2022-09-30   24       Choi       NaN     Choi  None
9          Kang 2022-10-31   22       Kang       NaN     Kang  None

In [61]:
df1.columns

Index(['name', 'birth', 'age', 'first_name', 'last_name', 0, 1], dtype='object')

In [67]:
df1.columns= (['name', 'birth', 'age', 'first_name', 'last_name', 'fN', 'LN'])
df1

           name      birth  age first_name last_name       fN    LN
0     HoJin Lee 2022-01-31   18      HoJin       Lee    HoJin   Lee
1  GilDong Hong 2022-02-28   17    GilDong      Hong  GilDong  Hong
2           Tom 2022-03-31   20        Tom       NaN      Tom  None
3           Lee 2022-04-30   19        Lee       NaN      Lee  None
4    Annan Jung 2022-05-31   22      Annan      Jung    Annan  Jung
5   SangUn Shin 2022-06-30   22     SangUn      Shin   SangUn  Shin
6  BungJun Park 2022-07-31   25    BungJun      Park  BungJun  Park
7    MinSu Shin 2022-08-31   21      MinSu      Shin    MinSu  Shin
8          Choi 2022-09-30   24       Choi       NaN     Choi  None
9          Kang 2022-10-31   22       Kang       NaN     Kang  None

In [68]:
df1.rename(columns={'0':'FName', '1': 'LName'}, inplace=True)
df1

           name      birth  age first_name last_name       fN    LN
0     HoJin Lee 2022-01-31   18      HoJin       Lee    HoJin   Lee
1  GilDong Hong 2022-02-28   17    GilDong      Hong  GilDong  Hong
2           Tom 2022-03-31   20        Tom       NaN      Tom  None
3           Lee 2022-04-30   19        Lee       NaN      Lee  None
4    Annan Jung 2022-05-31   22      Annan      Jung    Annan  Jung
5   SangUn Shin 2022-06-30   22     SangUn      Shin   SangUn  Shin
6  BungJun Park 2022-07-31   25    BungJun      Park  BungJun  Park
7    MinSu Shin 2022-08-31   21      MinSu      Shin    MinSu  Shin
8          Choi 2022-09-30   24       Choi       NaN     Choi  None
9          Kang 2022-10-31   22       Kang       NaN     Kang  None